Дошкольное_учреждение83/src/Catalogs/удуСтатьи/удуСтатьи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуСтатьи</name>
  <comment>Статьи журналов или отдельные произведения в сборниках</comment>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееОбозначениеМатериала</name>
    <type>
      <types>EnumRef.удуОбозначенияМетодическихМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Владельцы</name>
    <attributes>
      <name>УчетнаяЕдиница</name>
      <type>
        <types>CatalogRef.удуУчетныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Страницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.удуАвторы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/удуОбозначенияМетодическихМатериалов/удуОбозначенияМетодическихМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуОбозначенияМетодическихМатериалов</name>
  <enumValues>
    <name>Видеозапись</name>
  </enumValues>
  <enumValues>
    <name>Звукозапись</name>
  </enumValues>
  <enumValues>
    <name>Изоматериал</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Кинофильм</name>
  </enumValues>
  <enumValues>
    <name>Микроформа</name>
  </enumValues>
  <enumValues>
    <name>Мультимедиа</name>
  </enumValues>
  <enumValues>
    <name>Ноты</name>
  </enumValues>
  <enumValues>
    <name>Предмет</name>
  </enumValues>
  <enumValues>
    <name>Рукопись</name>
  </enumValues>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>ШрифтБрайля</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйРесурс</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуСтатьи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Владелец) Тогда
		НовВладелец = Объект.Владельцы.Добавить();
		НовВладелец.УчетнаяЕдиница = Параметры.Владелец;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ОбщееОбозначениеМатериала) Тогда
		Объект.ОбщееОбозначениеМатериала = Перечисления.удуОбозначенияМетодическихМатериалов.Текст;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставление()
	Объект.Представление = удуУчетМетодическихМатериалов.СформироватьПредставлениеСоставныеЧасти(ЭтаФорма);
КонецПроцедуры // ОбновитьПредставление()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбновитьПредставление();
КонецПроцедуры
